package dataset

var CompanyPrefixes = []string{
	"日本",
	"東京",
	"東和",
	"中央",
	"未来",
	"青葉",
	"関西",
	"北日本",
	"西日本",
	"旭日",
	"新星",
	"瑞穂",
	"さくら",
	"みらい",
	"あおば",
	"光和",
}

var CompanyCores = []string{
	"商事",
	"システム",
	"物流",
	"企画",
	"ソリューションズ",
	"フーズ",
	"工業",
	"建設",
	"不動産",
	"印刷",
	"食品",
	"製作所",
	"通信",
	"デザイン",
	"メディア",
	"エンジニアリング",
	"コンサルティング",
	"テクノロジー",
	"ネットワーク",
	"サービス",
	"パートナーズ",
}

var CompanyLegalTypes = []string{
	"株式会社",
	"合同会社",
	"有限会社",
}

var CompanyDepartments = []string{
	"営業部",
	"開発部",
	"人事部",
	"経理部",
	"総務部",
	"情報システム部",
	"品質保証部",
	"商品企画部",
	"マーケティング部",
	"カスタマーサポート部",
	"事業推進部",
	"管理本部",
}

var CompanyTitles = []string{
	"代表取締役",
	"取締役",
	"本部長",
	"部長",
	"課長",
	"係長",
	"主任",
	"担当者",
	"マネージャー",
	"アシスタントマネージャー",
}
